{
    "name":{
        "first": "Jacob",
        "middle": "Paul",
        "last": "Kamashian"
    },
    "location": "Layton, Utah, USA",
    "email": "jacobkamashian@gmail.com",
    "linkedIn": "https://www.linkedin.com/in/jacobkamashian/",
    "github": "https://github.com/",
    "summery": "Results-driven Senior Software Engineer with over 10 years of experience in full-stack development, project management, and team leadership. Proficient in delivering high-quality, scalable software solutions while collaborating effectively with cross-functional teams. Committed to meeting deadlines, driving business results, and mentoring junior colleagues through strong technical expertise, effective communication, and problem-solving skills.",
    "Experience":[
        {
            "Company":"Rakuten Advertising",
            "Role": "Senior Software Engineer",
            "Start": "03/22",
            "End": "",
            "Languages": ["GO", "SQL", "AQL", "JSON"],
            "Databases": ["MySql", "Areospike"],
            "Tools": ["Github", "Docker", "CircleCI", "Terraform", "GCP(Google Cloud Platform)", "Grafana", "Kubernetes", "Jira", "Confluence"],
            "Bullets": [
                "Spearheaded the development and maintenance on an Open RTB ad exchange server, primarily coding in Go, and deployed on GCP servers.",
                "Expertly integrated multiple third-party demand partners into our platform, significantly enhancing revenue streams and broadening market reach",
                "Pioneered a pivotal migration from JSON-based messaging to a more efficient GRPC in Pub/Sub, achieving over 30% cost reduction in messaging and storage.",
                "Authored comprehensive documentation and established coding and workflow standards, clarifying the onboarding process for new demand partners and streamlining developer training. This initiative dramatically reduced operational ambiguities and enhanced team productivity",
                "Mentored peers in software development best practices, fostering a collaborative and knowledge-sharing environment despite not having direct reports.",
                "Managed projects using Scrum and Kanban methodologies, ensuring agile and efficient workflow management"
            ]
        },
        {
            "Company": "Midigator",
            "Role": "Python Programmer",
            "Start": "03/22",
            "End": "",
            "Languages": ["Python", "SQL", "AQL", "JSON"],
            "Databases": ["MySql", "Mongo"],
            "Tools": ["Github", "Jira"],
            "Bullets": [
                "Accelerated data acquisition speed by 3x within the first month, significantly increasing efficiency.",
                "Built, maintained, and improved a scalable web automation platform to support company growth",
                "Trained team members in advanced data acquisition techniques, fostering a culture of continuous learning.",
                "Took on the Lead QA role during staffing shortage, ensuring product quality and timely delivery."
            ]
        }
    ]

}